Catalogs/КатегорииОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>КатегорииОбъектов</Name>
			<Comment>(Общ)</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НазначениеКатегории</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.НазначенияСвойствКатегорийОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодМДМ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШтампВерсии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/КатегорииОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КатегорииОбъектов</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Категория</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/КатегорииОбъектов/Ext/ManagerModule.bsl
Функция КатегорияОбъектаУстановлена(ПромОбъект,ПромКатегория) Экспорт 
	//+Кабанов А.В. 18.11.2024 #UT10-4904 
	
	ЗапросКатегории = Новый Запрос;
	ЗапросКатегории.Текст = 
	"ВЫБРАТЬ
	|	КатегорииОбъектов.Объект,
	|	КатегорииОбъектов.Категория
	|ИЗ
	|	РегистрСведений.КатегорииОбъектов КАК КатегорииОбъектов
	|ГДЕ
	|	КатегорииОбъектов.Объект = &Объект
	|	И КатегорииОбъектов.Категория = &Категория";
	
	ЗапросКатегории.УстановитьПараметр("Объект",ПромОбъект);
	ЗапросКатегории.УстановитьПараметр("Категория",ПромКатегория);
	
	Возврат НЕ ЗапросКатегории.Выполнить().Пустой();
	
	//-Кабанов А.В. 18.11.2024 #UT10-4904
КонецФункции

Функция УстановитьКатегориюОбъекта(СсылкаНаОбъект, КатегорияДляУстановки, ЗначениеПоКатегории = Истина) Экспорт
	
	//+Макрушин Е. 26.02.2026 #UT10-5657
	СтруктураВозврата = Новый Структура;
	
	Если ТипЗнч(КатегорияДляУстановки) = Тип("СправочникСсылка.КатегорииОбъектов") Тогда
		ТекКатегория = КатегорияДляУстановки;
	ИначеЕсли ТипЗнч(КатегорияДляУстановки) = Тип("Строка") Тогда
		
		ТекКатегория = Справочники.КатегорииОбъектов.НайтиПоНаименованию(КатегорияДляУстановки);
		
		Если Не ЗначениеЗаполнено(ТекКатегория) Тогда
			
			СтруктураВозврата.Вставить("ВыполненоУспешно", Ложь);
			СтруктураВозврата.Вставить("ОписаниеОшибки", "Не найдена категория " + КатегорияДляУстановки);
			
			Возврат СтруктураВозврата;
			
		КонецЕсли;
		
	Иначе	
		
		СтруктураВозврата.Вставить("ВыполненоУспешно", Ложь);
		СтруктураВозврата.Вставить("ОписаниеОшибки", "Передана некорректная категория " + КатегорияДляУстановки);
		
		Возврат СтруктураВозврата;
		
	КонецЕсли;
				  
	Набор = РегистрыСведений.КатегорииОбъектов.СоздатьНаборЗаписей();
	Набор.Отбор.Объект.Установить(СсылкаНаОбъект);
	Набор.Отбор.Категория.Установить(ТекКатегория);
	Набор.Прочитать();
	
	Если Набор.Количество() > 0 И Не ЗначениеПоКатегории Тогда// Категория Установлена, надо удалить
		
		Набор.Очистить();
		Набор.Записать();
		
	ИначеЕсли Набор.Количество() = 0 И ЗначениеПоКатегории Тогда // Категория отсутствует, надо создать
		
		НовЗапись = Набор.Добавить();
		НовЗапись.Объект = СсылкаНаОбъект;
		НовЗапись.Категория = ТекКатегория;
		Набор.Записать();
		
	Иначе
		// Категория актуальна,  ничего не меняем
	КонецЕсли;
	
	СтруктураВозврата.Вставить("ВыполненоУспешно", Истина);
	
	Возврат СтруктураВозврата;
	//-Макрушин Е. 26.02.2026 #UT10-5657
	
КонецФункции
